Revit 2027 API
TemperatureRating.GetTemperatureRatingIdByName Method
 Gets the Conductor Temperature Rating id by given Conductor Temperature Rating name.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetTemperatureRatingIdByName(
	Document document,
	string name
)
Public Shared Function GetTemperatureRatingIdByName (
	document As Document,
	name As String
) As ElementId
public:
static ElementId^ GetTemperatureRatingIdByName(
	Document^ document,
	String^ name
)
static member GetTemperatureRatingIdByName :
        document : Document *
        name : string -> ElementId
Parameters
document Document
 The document.
name String
 The Conductor Temperature Rating name.
Return Value
ElementId
 The Conductor Temperature Rating id.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- name is an empty string.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
See Also
Reference
TemperatureRating Class
Autodesk.Revit.DB.Electrical Namespace